fullyautomated/mspm0-svd/svd/mspm0l134x.svd
                <register>
                    <name>LINCTL</name>
                    <description>UART LIN Mode Control Register</description>
                    <addressOffset>0x1134</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>LINCTL_CTRENA</name>
                            <description>LIN Counter Enable. LIN counter will only count when enabled.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>LINCTL_CTRENA_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>LINCTL_CTRENA_ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>LINCTL_ZERONE</name>
                            <description>Zero on negative Edge of RXD. When enabled the counter is set to 0 and starts counting on a negative edge of RXD</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>LINCTL_ZERONE_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>LINCTL_ZERONE_ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>LINCTL_CNTRXLOW</name>
                            <description>Count while low Signal on RXD When counter is enabled and the signal on RXD is low, the counter increments.</description>
                            <bitOffset>0x2</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>LINCTL_CNTRXLOW_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>LINCTL_CNTRXLOW_ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>LINCTL_LINC0CAP</name>
                            <description>Capture Counter on negative RXD Edge. When enabled the counter value is captured to LINC0 register on each negative RXD edge. A LINC0 interrupt is triggered when enabled.</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>LINCTL_LINC0CAP_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>LINCTL_LINC0CAP_ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>LINCTL_LINC1CAP</name>
                            <description>Capture Counter on positive RXD Edge. When enabled the counter value is captured to LINC1 register on each positive RXD edge. A LINC1 interrupt is triggered when enabled.</description>
                            <bitOffset>0x5</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>LINCTL_LINC1CAP_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>LINCTL_LINC1CAP_ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>LINCTL_LINC0_MATCH</name>
                            <description>Counter Compare Match Mode  When this bit is set to 1 a counter compare match with LINC0 register triggers an LINC0 interrupt when enabled.</description>
                            <bitOffset>0x6</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>LINCTL_LINC0_MATCH_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>LINCTL_LINC0_MATCH_ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LINC0</name>
                    <description>UART LIN Mode Capture 0 Register</description>
                    <addressOffset>0x1138</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>LINC0_DATA</name>
                            <description>16 Bit Capture / Compare Register Captures current LINCTR value on RXD falling edge when enabled. It can generate a DATA interrupt on capture. If compare mode is enabled (DATA_MATCH = 1) a counter match can generate a LINC0 interrupt.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x10</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LINC1</name>
                    <description>UART LIN Mode Capture 1 Register</description>
                    <addressOffset>0x113C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>LINC1_DATA</name>
                            <description>16 Bit Capture / Compare Register Captures current LINCTR value on RXD rising edge when enabled. It can generate a LINC1 interrupt on capture.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x10</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IRCTL</name>
                    <description>eUSCI_Ax IrDA Control Word Register</description>
                    <addressOffset>0x1140</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000ffff</resetMask>
                    <fields>
                        <field>
                            <name>IRCTL_IRTXPL</name>
                            <description>Transmit pulse length.
Pulse length t(PULSE) = (IRTXPLx + 1) / [2 * f(IRTXCLK)]
(IRTXCLK = functional clock of the UART)</description>
                            <bitOffset>0x2</bitOffset>
                            <bitWidth>0x6</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IRCTL_IRRXPL</name>
                            <description>IrDA receive input UCAxRXD polarity</description>
                            <bitOffset>0x9</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>IRCTL_IRRXPL_HIGH</name>
                                    <description>HIGHPULSE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IRCTL_IRRXPL_LOW</name>
                                    <description>LOWPULSE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>IRCTL_IREN</name>
                            <description>IrDA encoder/decoder enable</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>IRCTL_IREN_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IRCTL_IREN_ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>IRCTL_IRTXCLK</name>
                            <description>IrDA transmit pulse clock select</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>IRCTL_IRTXCLK_BITCLK</name>
                                    <description>BITCLK</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IRCTL_IRTXCLK_BRCLK</name>
                                    <description>BRCLK</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>AMASK</name>
                    <description>Self Address Mask Register</description>
                    <addressOffset>0x1148</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x000000ff</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>AMASK_VALUE</name>
                            <description>Self Address Mask for 9-Bit Mode  This field contains the address mask that creates a set of addresses that should be matched.  A 0 bit in the MSK bitfield configures, that the corresponding bit in the ADDR bitfield of the UART9BITADDR register is don't care. A 1 bit in the MSK bitfield configures, that the corresponding bit in the ADDR bitfield of the UART9BITADDR register must match.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADDR</name>
                    <description>Self Address Register</description>
                    <addressOffset>0x114C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>ADDR_VALUE</name>
                            <description>Self Address for 9-Bit Mode  This field contains the address that should be matched when UART9BITAMASK is FFh.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CLKDIV2</name>
                    <description>Clock Divider</description>
                    <addressOffset>0x1160</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CLKDIV2_RATIO</name>
                            <description>Selects divide ratio of module clock</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x3</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CLKDIV2_RATIO_DIV_BY_1</name>
                                    <description>DIV_BY_1</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CLKDIV2_RATIO_DIV_BY_2</name>
                                    <description>DIV_BY_2</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CLKDIV2_RATIO_DIV_BY_3</name>
                                    <description>DIV_BY_3</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CLKDIV2_RATIO_DIV_BY_4</name>
                                    <description>DIV_BY_4</description>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CLKDIV2_RATIO_DIV_BY_5</name>
                                    <description>DIV_BY_5</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CLKDIV2_RATIO_DIV_BY_6</name>
                                    <description>DIV_BY_6</description>
                                    <value>5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CLKDIV2_RATIO_DIV_BY_7</name>
                                    <description>DIV_BY_7</description>
                                    <value>6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CLKDIV2_RATIO_DIV_BY_8</name>
                                    <description>DIV_BY_8</description>
                                    <value>7</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
            </registers></peripheral>
        <peripheral>
            <name>FLASHCTL</name>
            <version>1.0</version>
            <description>F65NW</description>
            <baseAddress>0x400CD000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x2000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers><register>
                    <name>IIDX</name>
                    <description>Interrupt Index Register</description>
                    <addressOffset>0x1020</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IIDX_STAT</name>
                            <description>Indicates which interrupt has fired. 0x0 means no event pending. The priority order is fixed. On each read, only one interrupt is indicated. On a read, the current interrupt (highest priority) is automatically cleared by the hardware and the corresponding interrupt flags in the RIS and MIS are cleared as well. After a read from the CPU (not from the debug interface), the register must be updated with the next highest priority interrupt.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>IIDX_STAT_NO_INTR</name>
                                    <description>NO_INTR</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IIDX_STAT_DONE</name>
                                    <description>DONE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IMASK</name>
                    <description>Interrupt Mask Register</description>
                    <addressOffset>0x1028</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>IMASK_DONE</name>
                            <description>Interrupt mask for DONE:
0: Interrupt is disabled in MIS register
1: Interrupt is enabled in MIS register</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>IMASK_DONE_DISABLED</name>
                                    <description>DISABLED</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IMASK_DONE_ENABLED</name>
                                    <description>ENABLED</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
