fullyautomated/mspm0-svd/svd/mspm0l134x.svd
                <register>
                    <name>INT_EVENT1_ICLR</name>
                    <description>Interrupt clear</description>
                    <addressOffset>0x1078</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INT_EVENT1_ICLR_RX</name>
                            <description>Clear Receive FIFO event.</description>
                            <bitOffset>0x3</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT1_ICLR_RX_NO_EFFECT</name>
                                    <description>NO_EFFECT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT1_ICLR_RX_CLR</name>
                                    <description>CLR</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INT_EVENT1_ICLR_RTOUT</name>
                            <description>Clear SPI Receive Time-Out event.</description>
                            <bitOffset>0x2</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT1_ICLR_RTOUT_NO_EFFECT</name>
                                    <description>NO_EFFECT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT1_ICLR_RTOUT_CLR</name>
                                    <description>CLR</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INT_EVENT2_IIDX</name>
                    <description>Interrupt Index Register</description>
                    <addressOffset>0x1080</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INT_EVENT2_IIDX_STAT</name>
                            <description>Interrupt index status</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT2_IIDX_STAT_NO_INTR</name>
                                    <description>NO_INTR</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT2_IIDX_STAT_TX_EVT</name>
                                    <description>TX_EVT</description>
                                    <value>5</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INT_EVENT2_IMASK</name>
                    <description>Interrupt mask</description>
                    <addressOffset>0x1088</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INT_EVENT2_IMASK_TX</name>
                            <description>Transmit FIFO event mask.</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT2_IMASK_TX_CLR</name>
                                    <description>CLR</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT2_IMASK_TX_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INT_EVENT2_RIS</name>
                    <description>Raw interrupt status</description>
                    <addressOffset>0x1090</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>INT_EVENT2_RIS_TX</name>
                            <description>Transmit FIFO event:
A read returns the current mask for transmit FIFO interrupt. On a write of 1, the mask for transmit FIFO interrupt is set which means the interrupt state will be reflected in MIS.TXMIS. A write of 0 clears the mask which means MIS.TXMIS will not reflect the interrupt.</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT2_RIS_TX_CLR</name>
                                    <description>CLR</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT2_RIS_TX_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INT_EVENT2_MIS</name>
                    <description>Masked interrupt status</description>
                    <addressOffset>0x1098</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INT_EVENT2_MIS_TX</name>
                            <description>Masked Transmit FIFO event</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT2_MIS_TX_CLR</name>
                                    <description>CLR</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT2_MIS_TX_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INT_EVENT2_ISET</name>
                    <description>Interrupt set</description>
                    <addressOffset>0x10A0</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INT_EVENT2_ISET_TX</name>
                            <description>Set Transmit FIFO event.</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT2_ISET_TX_NO_EFFECT</name>
                                    <description>NO_EFFECT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT2_ISET_TX_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INT_EVENT2_ICLR</name>
                    <description>Interrupt clear</description>
                    <addressOffset>0x10A8</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INT_EVENT2_ICLR_TX</name>
                            <description>Clear Transmit FIFO event.</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT2_ICLR_TX_NO_EFFECT</name>
                                    <description>NO_EFFECT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT2_ICLR_TX_CLR</name>
                                    <description>CLR</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EVT_MODE</name>
                    <description>Event Mode</description>
                    <addressOffset>0x10E0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>EVT_MODE_INT0_CFG</name>
                            <description>Event line mode select for event corresponding to [IPSTANDARD.INT_EVENT0]</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>EVT_MODE_INT0_CFG_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>EVT_MODE_INT0_CFG_SOFTWARE</name>
                                    <description>SOFTWARE</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>EVT_MODE_INT0_CFG_HARDWARE</name>
                                    <description>HARDWARE</description>
                                    <value>2</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>EVT_MODE_INT1_CFG</name>
                            <description>Event line mode select for event corresponding to [IPSTANDARD.INT_EVENT1]</description>
                            <bitOffset>0x2</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>EVT_MODE_INT1_CFG_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>EVT_MODE_INT1_CFG_SOFTWARE</name>
                                    <description>SOFTWARE</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>EVT_MODE_INT1_CFG_HARDWARE</name>
                                    <description>HARDWARE</description>
                                    <value>2</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>EVT_MODE_INT2_CFG</name>
                            <description>Event line mode select for event corresponding to [IPSTANDARD.INT_EVENT2]</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>EVT_MODE_INT2_CFG_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>EVT_MODE_INT2_CFG_SOFTWARE</name>
                                    <description>SOFTWARE</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>EVT_MODE_INT2_CFG_HARDWARE</name>
                                    <description>HARDWARE</description>
                                    <value>2</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
