fullyautomated/mspm0-svd/svd/mspm0l134x.svd
            <register>
                    <name>CLKOVR</name>
                    <description>Clock Override</description>
                    <addressOffset>0x1010</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CLKOVR_OVERRIDE</name>
                            <description>Unlocks the functionality of [RUN_STOP] to override the automatic peripheral clock request</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CLKOVR_OVERRIDE_DISABLED</name>
                                    <description>DISABLED</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CLKOVR_OVERRIDE_ENABLED</name>
                                    <description>ENABLED</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CLKOVR_RUN_STOP</name>
                            <description>If [OVERRIDE] is enabled, this register is used to manually control the peripheral's clock request to the system</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CLKOVR_RUN_STOP_RUN</name>
                                    <description>RUN</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CLKOVR_RUN_STOP_STOP</name>
                                    <description>STOP</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PDBGCTL</name>
                    <description>Peripheral Debug Control</description>
                    <addressOffset>0x1018</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000001</resetValue>
                    <fields>
                        <field>
                            <name>PDBGCTL_FREE</name>
                            <description>Free run control</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PDBGCTL_FREE_STOP</name>
                                    <description>STOP</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PDBGCTL_FREE_RUN</name>
                                    <description>RUN</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INT_EVENT0_IIDX</name>
                    <description>Interrupt index</description>
                    <addressOffset>0x1020</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INT_EVENT0_IIDX_STAT</name>
                            <description>Interrupt index status</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_NO_INTR</name>
                                    <description>NO_INTR</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_DIO0</name>
                                    <description>DIO0</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_DIO1</name>
                                    <description>DIO1</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_DIO2</name>
                                    <description>DIO2</description>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_DIO3</name>
                                    <description>DIO3</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_DIO4</name>
                                    <description>DIO4</description>
                                    <value>5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_DIO5</name>
                                    <description>DIO5</description>
                                    <value>6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_DIO6</name>
                                    <description>DIO6</description>
                                    <value>7</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_DIO7</name>
                                    <description>DIO7</description>
                                    <value>8</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_DIO8</name>
                                    <description>DIO8</description>
                                    <value>9</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_DIO9</name>
                                    <description>DIO9</description>
                                    <value>10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_DIO10</name>
                                    <description>DIO10</description>
                                    <value>11</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_DIO11</name>
                                    <description>DIO11</description>
                                    <value>12</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_DIO12</name>
                                    <description>DIO12</description>
                                    <value>13</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_DIO13</name>
                                    <description>DIO13</description>
                                    <value>14</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_DIO14</name>
                                    <description>DIO14</description>
                                    <value>15</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_DIO15</name>
                                    <description>DIO15</description>
                                    <value>16</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_DIO16</name>
                                    <description>DIO16</description>
                                    <value>17</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_DIO17</name>
                                    <description>DIO17</description>
                                    <value>18</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_DIO18</name>
                                    <description>DIO18</description>
                                    <value>19</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_DIO19</name>
                                    <description>DIO19</description>
                                    <value>20</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_DIO20</name>
                                    <description>DIO20</description>
                                    <value>21</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_DIO21</name>
                                    <description>DIO21</description>
                                    <value>22</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_DIO22</name>
                                    <description>DIO22</description>
                                    <value>23</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_DIO23</name>
                                    <description>DIO23</description>
                                    <value>24</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_DIO24</name>
                                    <description>DIO24</description>
                                    <value>25</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_DIO25</name>
                                    <description>DIO25</description>
                                    <value>26</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_DIO26</name>
                                    <description>DIO26</description>
                                    <value>27</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_DIO27</name>
                                    <description>DIO27</description>
                                    <value>28</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_DIO28</name>
                                    <description>DIO28</description>
                                    <value>29</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_DIO29</name>
                                    <description>DIO29</description>
                                    <value>30</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_DIO30</name>
                                    <description>DIO30</description>
                                    <value>31</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_DIO31</name>
                                    <description>DIO31</description>
                                    <value>32</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
