fullyautomated/mspm0-svd/svd/mspm0l134x.svd
                        </field>
                        <field>
                            <name>INT_EVENT0_MIS_DIO24</name>
                            <description>DIO24 event</description>
                            <bitOffset>0x18</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT0_MIS_DIO24_CLR</name>
                                    <description>CLR</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_MIS_DIO24_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INT_EVENT0_MIS_DIO25</name>
                            <description>DIO25 event</description>
                            <bitOffset>0x19</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT0_MIS_DIO25_CLR</name>
                                    <description>CLR</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_MIS_DIO25_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INT_EVENT0_MIS_DIO26</name>
                            <description>DIO26 event</description>
                            <bitOffset>0x1A</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT0_MIS_DIO26_CLR</name>
                                    <description>CLR</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_MIS_DIO26_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INT_EVENT0_MIS_DIO27</name>
                            <description>DIO27 event</description>
                            <bitOffset>0x1B</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT0_MIS_DIO27_CLR</name>
                                    <description>CLR</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_MIS_DIO27_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INT_EVENT0_MIS_DIO28</name>
                            <description>DIO28 event</description>
                            <bitOffset>0x1C</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT0_MIS_DIO28_CLR</name>
                                    <description>CLR</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_MIS_DIO28_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INT_EVENT0_MIS_DIO29</name>
                            <description>DIO29 event</description>
                            <bitOffset>0x1D</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT0_MIS_DIO29_CLR</name>
                                    <description>CLR</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_MIS_DIO29_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INT_EVENT0_MIS_DIO30</name>
                            <description>DIO30 event</description>
                            <bitOffset>0x1E</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT0_MIS_DIO30_CLR</name>
                                    <description>CLR</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_MIS_DIO30_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INT_EVENT0_MIS_DIO31</name>
                            <description>DIO31 event</description>
                            <bitOffset>0x1F</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT0_MIS_DIO31_CLR</name>
                                    <description>CLR</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_MIS_DIO31_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
