fullyautomated/mspm0-svd/svd/mspm0l134x.svd
                <register>
                    <name>INT_EVENT1_RIS</name>
                    <description>Raw interrupt status</description>
                    <addressOffset>0x1060</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INT_EVENT1_RIS_DIO0</name>
                            <description>DIO0 event</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT1_RIS_DIO0_CLR</name>
                                    <description>CLR</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT1_RIS_DIO0_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INT_EVENT1_RIS_DIO1</name>
                            <description>DIO1 event</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT1_RIS_DIO1_CLR</name>
                                    <description>CLR</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT1_RIS_DIO1_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INT_EVENT1_RIS_DIO2</name>
                            <description>DIO2 event</description>
                            <bitOffset>0x2</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT1_RIS_DIO2_CLR</name>
                                    <description>CLR</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT1_RIS_DIO2_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INT_EVENT1_RIS_DIO3</name>
                            <description>DIO3 event</description>
                            <bitOffset>0x3</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT1_RIS_DIO3_CLR</name>
                                    <description>CLR</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT1_RIS_DIO3_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INT_EVENT1_RIS_DIO4</name>
                            <description>DIO4 event</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT1_RIS_DIO4_CLR</name>
                                    <description>CLR</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT1_RIS_DIO4_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INT_EVENT1_RIS_DIO5</name>
                            <description>DIO5 event</description>
                            <bitOffset>0x5</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT1_RIS_DIO5_CLR</name>
                                    <description>CLR</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT1_RIS_DIO5_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INT_EVENT1_RIS_DIO6</name>
                            <description>DIO6 event</description>
                            <bitOffset>0x6</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT1_RIS_DIO6_CLR</name>
                                    <description>CLR</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT1_RIS_DIO6_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INT_EVENT1_RIS_DIO7</name>
                            <description>DIO7 event</description>
                            <bitOffset>0x7</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT1_RIS_DIO7_CLR</name>
                                    <description>CLR</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT1_RIS_DIO7_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INT_EVENT1_RIS_DIO8</name>
                            <description>DIO8 event</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT1_RIS_DIO8_CLR</name>
                                    <description>CLR</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT1_RIS_DIO8_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INT_EVENT1_RIS_DIO9</name>
                            <description>DIO9 event</description>
                            <bitOffset>0x9</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT1_RIS_DIO9_CLR</name>
                                    <description>CLR</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT1_RIS_DIO9_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INT_EVENT1_RIS_DIO10</name>
                            <description>DIO10 event</description>
                            <bitOffset>0xA</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT1_RIS_DIO10_CLR</name>
                                    <description>CLR</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT1_RIS_DIO10_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INT_EVENT1_RIS_DIO11</name>
                            <description>DIO11 event</description>
                            <bitOffset>0xB</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT1_RIS_DIO11_CLR</name>
                                    <description>CLR</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT1_RIS_DIO11_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INT_EVENT1_RIS_DIO12</name>
                            <description>DIO12 event</description>
                            <bitOffset>0xC</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT1_RIS_DIO12_CLR</name>
                                    <description>CLR</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT1_RIS_DIO12_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INT_EVENT1_RIS_DIO13</name>
                            <description>DIO13 event</description>
                            <bitOffset>0xD</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT1_RIS_DIO13_CLR</name>
                                    <description>CLR</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT1_RIS_DIO13_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INT_EVENT1_RIS_DIO14</name>
                            <description>DIO14 event</description>
                            <bitOffset>0xE</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT1_RIS_DIO14_CLR</name>
                                    <description>CLR</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT1_RIS_DIO14_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INT_EVENT1_RIS_DIO15</name>
                            <description>DIO15 event</description>
                            <bitOffset>0xF</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT1_RIS_DIO15_CLR</name>
                                    <description>CLR</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT1_RIS_DIO15_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
