fullyautomated/mspm0-svd/svd/mspm0l134x.svd
                <register>
                    <name>DIN31_28</name>
                    <description>Data input 31 to 28</description>
                    <addressOffset>0x131C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DIN31_28_DIO28</name>
                            <description>This bit reads the data input value of DIO28.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DIN31_28_DIO28_ZERO</name>
                                    <description>ZERO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIN31_28_DIO28_ONE</name>
                                    <description>ONE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DIN31_28_DIO29</name>
                            <description>This bit reads the data input value of DIO29.</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DIN31_28_DIO29_ZERO</name>
                                    <description>ZERO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIN31_28_DIO29_ONE</name>
                                    <description>ONE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DIN31_28_DIO30</name>
                            <description>This bit reads the data input value of DIO30.</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DIN31_28_DIO30_ZERO</name>
                                    <description>ZERO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIN31_28_DIO30_ONE</name>
                                    <description>ONE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DIN31_28_DIO31</name>
                            <description>This bit reads the data input value of DIO31.</description>
                            <bitOffset>0x18</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DIN31_28_DIO31_ZERO</name>
                                    <description>ZERO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIN31_28_DIO31_ONE</name>
                                    <description>ONE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIN31_0</name>
                    <description>Data input 31 to 0</description>
                    <addressOffset>0x1380</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DIN31_0_DIO0</name>
                            <description>This bit reads the data input value of DIO0.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DIN31_0_DIO0_ZERO</name>
                                    <description>ZERO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIN31_0_DIO0_ONE</name>
                                    <description>ONE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DIN31_0_DIO1</name>
                            <description>This bit reads the data input value of DIO1.</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DIN31_0_DIO1_ZERO</name>
                                    <description>ZERO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIN31_0_DIO1_ONE</name>
                                    <description>ONE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DIN31_0_DIO2</name>
                            <description>This bit reads the data input value of DIO2.</description>
                            <bitOffset>0x2</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DIN31_0_DIO2_ZERO</name>
                                    <description>ZERO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIN31_0_DIO2_ONE</name>
                                    <description>ONE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DIN31_0_DIO3</name>
                            <description>This bit reads the data input value of DIO3.</description>
                            <bitOffset>0x3</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DIN31_0_DIO3_ZERO</name>
                                    <description>ZERO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIN31_0_DIO3_ONE</name>
                                    <description>ONE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DIN31_0_DIO4</name>
                            <description>This bit reads the data input value of DIO4.</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DIN31_0_DIO4_ZERO</name>
                                    <description>ZERO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIN31_0_DIO4_ONE</name>
                                    <description>ONE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DIN31_0_DIO5</name>
                            <description>This bit reads the data input value of DIO5.</description>
                            <bitOffset>0x5</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DIN31_0_DIO5_ZERO</name>
                                    <description>ZERO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIN31_0_DIO5_ONE</name>
                                    <description>ONE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DIN31_0_DIO6</name>
                            <description>This bit reads the data input value of DIO6.</description>
                            <bitOffset>0x6</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DIN31_0_DIO6_ZERO</name>
                                    <description>ZERO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIN31_0_DIO6_ONE</name>
                                    <description>ONE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DIN31_0_DIO7</name>
                            <description>This bit reads the data input value of DIO7.</description>
                            <bitOffset>0x7</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DIN31_0_DIO7_ZERO</name>
                                    <description>ZERO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIN31_0_DIO7_ONE</name>
                                    <description>ONE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DIN31_0_DIO8</name>
                            <description>This bit reads the data input value of DIO8.</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DIN31_0_DIO8_ZERO</name>
                                    <description>ZERO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIN31_0_DIO8_ONE</name>
                                    <description>ONE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DIN31_0_DIO9</name>
                            <description>This bit reads the data input value of DIO9.</description>
                            <bitOffset>0x9</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DIN31_0_DIO9_ZERO</name>
                                    <description>ZERO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIN31_0_DIO9_ONE</name>
                                    <description>ONE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DIN31_0_DIO10</name>
                            <description>This bit reads the data input value of DIO10.</description>
                            <bitOffset>0xA</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DIN31_0_DIO10_ZERO</name>
                                    <description>ZERO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIN31_0_DIO10_ONE</name>
                                    <description>ONE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DIN31_0_DIO11</name>
                            <description>This bit reads the data input value of DIO11.</description>
                            <bitOffset>0xB</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DIN31_0_DIO11_ZERO</name>
                                    <description>ZERO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIN31_0_DIO11_ONE</name>
                                    <description>ONE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DIN31_0_DIO12</name>
                            <description>This bit reads the data input value of DIO12.</description>
                            <bitOffset>0xC</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DIN31_0_DIO12_ZERO</name>
                                    <description>ZERO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIN31_0_DIO12_ONE</name>
                                    <description>ONE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DIN31_0_DIO13</name>
                            <description>This bit reads the data input value of DIO13.</description>
                            <bitOffset>0xD</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DIN31_0_DIO13_ZERO</name>
                                    <description>ZERO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIN31_0_DIO13_ONE</name>
                                    <description>ONE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DIN31_0_DIO14</name>
                            <description>This bit reads the data input value of DIO14.</description>
                            <bitOffset>0xE</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DIN31_0_DIO14_ZERO</name>
                                    <description>ZERO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIN31_0_DIO14_ONE</name>
                                    <description>ONE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DIN31_0_DIO15</name>
                            <description>This bit reads the data input value of DIO15.</description>
                            <bitOffset>0xF</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DIN31_0_DIO15_ZERO</name>
                                    <description>ZERO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIN31_0_DIO15_ONE</name>
                                    <description>ONE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DIN31_0_DIO16</name>
                            <description>This bit reads the data input value of DIO16.</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DIN31_0_DIO16_ZERO</name>
                                    <description>ZERO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIN31_0_DIO16_ONE</name>
                                    <description>ONE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DIN31_0_DIO17</name>
                            <description>This bit reads the data input value of DIO17.</description>
                            <bitOffset>0x11</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DIN31_0_DIO17_ZERO</name>
                                    <description>ZERO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIN31_0_DIO17_ONE</name>
                                    <description>ONE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
