fullyautomated/mspm0-svd/svd/mspm0l134x.svd
                        </field>
                        <field>
                            <name>POLARITY15_0_DIO14</name>
                            <description>Enables and configures edge detection polarity for DIO14.</description>
                            <bitOffset>0x1C</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>POLARITY15_0_DIO14_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY15_0_DIO14_RISE</name>
                                    <description>RISE</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY15_0_DIO14_FALL</name>
                                    <description>FALL</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY15_0_DIO14_RISE_FALL</name>
                                    <description>RISE_FALL</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>POLARITY15_0_DIO15</name>
                            <description>Enables and configures edge detection polarity for DIO15.</description>
                            <bitOffset>0x1E</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>POLARITY15_0_DIO15_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY15_0_DIO15_RISE</name>
                                    <description>RISE</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY15_0_DIO15_FALL</name>
                                    <description>FALL</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY15_0_DIO15_RISE_FALL</name>
                                    <description>RISE_FALL</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>POLARITY31_16</name>
                    <description>Polarity 31 to 16</description>
                    <addressOffset>0x13A0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>POLARITY31_16_DIO16</name>
                            <description>Enables and configures edge detection polarity for DIO16.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>POLARITY31_16_DIO16_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY31_16_DIO16_RISE</name>
                                    <description>RISE</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY31_16_DIO16_FALL</name>
                                    <description>FALL</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY31_16_DIO16_RISE_FALL</name>
                                    <description>RISE_FALL</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>POLARITY31_16_DIO17</name>
                            <description>Enables and configures edge detection polarity for DIO17.</description>
                            <bitOffset>0x2</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>POLARITY31_16_DIO17_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY31_16_DIO17_RISE</name>
                                    <description>RISE</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY31_16_DIO17_FALL</name>
                                    <description>FALL</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY31_16_DIO17_RISE_FALL</name>
                                    <description>RISE_FALL</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>POLARITY31_16_DIO18</name>
                            <description>Enables and configures edge detection polarity for DIO18.</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>POLARITY31_16_DIO18_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY31_16_DIO18_RISE</name>
                                    <description>RISE</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY31_16_DIO18_FALL</name>
                                    <description>FALL</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY31_16_DIO18_RISE_FALL</name>
                                    <description>RISE_FALL</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>POLARITY31_16_DIO19</name>
                            <description>Enables and configures edge detection polarity for DIO19.</description>
                            <bitOffset>0x6</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>POLARITY31_16_DIO19_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY31_16_DIO19_RISE</name>
                                    <description>RISE</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY31_16_DIO19_FALL</name>
                                    <description>FALL</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY31_16_DIO19_RISE_FALL</name>
                                    <description>RISE_FALL</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>POLARITY31_16_DIO20</name>
                            <description>Enables and configures edge detection polarity for DIO20.</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>POLARITY31_16_DIO20_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY31_16_DIO20_RISE</name>
                                    <description>RISE</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY31_16_DIO20_FALL</name>
                                    <description>FALL</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY31_16_DIO20_RISE_FALL</name>
                                    <description>RISE_FALL</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>POLARITY31_16_DIO21</name>
                            <description>Enables and configures edge detection polarity for DIO21.</description>
                            <bitOffset>0xA</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>POLARITY31_16_DIO21_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY31_16_DIO21_RISE</name>
                                    <description>RISE</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY31_16_DIO21_FALL</name>
                                    <description>FALL</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY31_16_DIO21_RISE_FALL</name>
                                    <description>RISE_FALL</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>POLARITY31_16_DIO22</name>
                            <description>Enables and configures edge detection polarity for DIO22.</description>
                            <bitOffset>0xC</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>POLARITY31_16_DIO22_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY31_16_DIO22_RISE</name>
                                    <description>RISE</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY31_16_DIO22_FALL</name>
                                    <description>FALL</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY31_16_DIO22_RISE_FALL</name>
                                    <description>RISE_FALL</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>POLARITY31_16_DIO23</name>
                            <description>Enables and configures edge detection polarity for DIO23.</description>
                            <bitOffset>0xE</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>POLARITY31_16_DIO23_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY31_16_DIO23_RISE</name>
                                    <description>RISE</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY31_16_DIO23_FALL</name>
                                    <description>FALL</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY31_16_DIO23_RISE_FALL</name>
                                    <description>RISE_FALL</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>POLARITY31_16_DIO24</name>
                            <description>Enables and configures edge detection polarity for DIO24.</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>POLARITY31_16_DIO24_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY31_16_DIO24_RISE</name>
                                    <description>RISE</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY31_16_DIO24_FALL</name>
                                    <description>FALL</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY31_16_DIO24_RISE_FALL</name>
                                    <description>RISE_FALL</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>POLARITY31_16_DIO25</name>
                            <description>Enables and configures edge detection polarity for DIO25.</description>
                            <bitOffset>0x12</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>POLARITY31_16_DIO25_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY31_16_DIO25_RISE</name>
                                    <description>RISE</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY31_16_DIO25_FALL</name>
                                    <description>FALL</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY31_16_DIO25_RISE_FALL</name>
                                    <description>RISE_FALL</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>POLARITY31_16_DIO26</name>
                            <description>Enables and configures edge detection polarity for DIO26.</description>
                            <bitOffset>0x14</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>POLARITY31_16_DIO26_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY31_16_DIO26_RISE</name>
                                    <description>RISE</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY31_16_DIO26_FALL</name>
                                    <description>FALL</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY31_16_DIO26_RISE_FALL</name>
                                    <description>RISE_FALL</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>POLARITY31_16_DIO27</name>
                            <description>Enables and configures edge detection polarity for DIO27.</description>
                            <bitOffset>0x16</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>POLARITY31_16_DIO27_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY31_16_DIO27_RISE</name>
                                    <description>RISE</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY31_16_DIO27_FALL</name>
                                    <description>FALL</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY31_16_DIO27_RISE_FALL</name>
