fullyautomated/mspm0-svd/svd/mspm0l134x.svd
                <register>
                    <name>FILTEREN15_0</name>
                    <description>Filter Enable 15 to 0</description>
                    <addressOffset>0x1508</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>FILTEREN15_0_DIN0</name>
                            <description>Programmable counter length of digital glitch filter for DIN0</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>FILTEREN15_0_DIN0_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN15_0_DIN0_ONE_CYCLE</name>
                                    <description>ONE_CYCLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN15_0_DIN0_THREE_CYCLE</name>
                                    <description>THREE_CYCLE</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN15_0_DIN0_EIGHT_CYCLE</name>
                                    <description>EIGHT_CYCLE</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>FILTEREN15_0_DIN1</name>
                            <description>Programmable counter length of digital glitch filter for DIN1</description>
                            <bitOffset>0x2</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>FILTEREN15_0_DIN1_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN15_0_DIN1_ONE_CYCLE</name>
                                    <description>ONE_CYCLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN15_0_DIN1_THREE_CYCLE</name>
                                    <description>THREE_CYCLE</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN15_0_DIN1_EIGHT_CYCLE</name>
                                    <description>EIGHT_CYCLE</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>FILTEREN15_0_DIN2</name>
                            <description>Programmable counter length of digital glitch filter for DIN2</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>FILTEREN15_0_DIN2_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN15_0_DIN2_ONE_CYCLE</name>
                                    <description>ONE_CYCLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN15_0_DIN2_THREE_CYCLE</name>
                                    <description>THREE_CYCLE</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN15_0_DIN2_EIGHT_CYCLE</name>
                                    <description>EIGHT_CYCLE</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>FILTEREN15_0_DIN3</name>
                            <description>Programmable counter length of digital glitch filter for DIN3</description>
                            <bitOffset>0x6</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>FILTEREN15_0_DIN3_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN15_0_DIN3_ONE_CYCLE</name>
                                    <description>ONE_CYCLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN15_0_DIN3_THREE_CYCLE</name>
                                    <description>THREE_CYCLE</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN15_0_DIN3_EIGHT_CYCLE</name>
                                    <description>EIGHT_CYCLE</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>FILTEREN15_0_DIN4</name>
                            <description>Programmable counter length of digital glitch filter for DIN4</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>FILTEREN15_0_DIN4_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN15_0_DIN4_ONE_CYCLE</name>
                                    <description>ONE_CYCLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN15_0_DIN4_THREE_CYCLE</name>
                                    <description>THREE_CYCLE</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN15_0_DIN4_EIGHT_CYCLE</name>
                                    <description>EIGHT_CYCLE</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>FILTEREN15_0_DIN5</name>
                            <description>Programmable counter length of digital glitch filter for DIN5</description>
                            <bitOffset>0xA</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>FILTEREN15_0_DIN5_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN15_0_DIN5_ONE_CYCLE</name>
                                    <description>ONE_CYCLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN15_0_DIN5_THREE_CYCLE</name>
                                    <description>THREE_CYCLE</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN15_0_DIN5_EIGHT_CYCLE</name>
                                    <description>EIGHT_CYCLE</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>FILTEREN15_0_DIN6</name>
                            <description>Programmable counter length of digital glitch filter for DIN6</description>
                            <bitOffset>0xC</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>FILTEREN15_0_DIN6_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN15_0_DIN6_ONE_CYCLE</name>
                                    <description>ONE_CYCLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN15_0_DIN6_THREE_CYCLE</name>
                                    <description>THREE_CYCLE</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN15_0_DIN6_EIGHT_CYCLE</name>
                                    <description>EIGHT_CYCLE</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>FILTEREN15_0_DIN7</name>
                            <description>Programmable counter length of digital glitch filter for DIN7</description>
                            <bitOffset>0xE</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>FILTEREN15_0_DIN7_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN15_0_DIN7_ONE_CYCLE</name>
                                    <description>ONE_CYCLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN15_0_DIN7_THREE_CYCLE</name>
                                    <description>THREE_CYCLE</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN15_0_DIN7_EIGHT_CYCLE</name>
                                    <description>EIGHT_CYCLE</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>FILTEREN15_0_DIN8</name>
                            <description>Programmable counter length of digital glitch filter for DIN8</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>FILTEREN15_0_DIN8_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN15_0_DIN8_ONE_CYCLE</name>
                                    <description>ONE_CYCLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN15_0_DIN8_THREE_CYCLE</name>
                                    <description>THREE_CYCLE</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN15_0_DIN8_EIGHT_CYCLE</name>
                                    <description>EIGHT_CYCLE</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>FILTEREN15_0_DIN9</name>
                            <description>Programmable counter length of digital glitch filter for DIN9</description>
                            <bitOffset>0x12</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>FILTEREN15_0_DIN9_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN15_0_DIN9_ONE_CYCLE</name>
                                    <description>ONE_CYCLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN15_0_DIN9_THREE_CYCLE</name>
                                    <description>THREE_CYCLE</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN15_0_DIN9_EIGHT_CYCLE</name>
                                    <description>EIGHT_CYCLE</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>FILTEREN15_0_DIN10</name>
                            <description>Programmable counter length of digital glitch filter for DIN10</description>
                            <bitOffset>0x14</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>FILTEREN15_0_DIN10_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN15_0_DIN10_ONE_CYCLE</name>
                                    <description>ONE_CYCLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN15_0_DIN10_THREE_CYCLE</name>
                                    <description>THREE_CYCLE</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN15_0_DIN10_EIGHT_CYCLE</name>
                                    <description>EIGHT_CYCLE</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>FILTEREN15_0_DIN11</name>
                            <description>Programmable counter length of digital glitch filter for DIN11</description>
                            <bitOffset>0x16</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>FILTEREN15_0_DIN11_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN15_0_DIN11_ONE_CYCLE</name>
                                    <description>ONE_CYCLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN15_0_DIN11_THREE_CYCLE</name>
                                    <description>THREE_CYCLE</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN15_0_DIN11_EIGHT_CYCLE</name>
                                    <description>EIGHT_CYCLE</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>FILTEREN15_0_DIN12</name>
                            <description>Programmable counter length of digital glitch filter for DIN12</description>
                            <bitOffset>0x18</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>FILTEREN15_0_DIN12_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN15_0_DIN12_ONE_CYCLE</name>
                                    <description>ONE_CYCLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN15_0_DIN12_THREE_CYCLE</name>
                                    <description>THREE_CYCLE</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN15_0_DIN12_EIGHT_CYCLE</name>
                                    <description>EIGHT_CYCLE</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>FILTEREN15_0_DIN13</name>
                            <description>Programmable counter length of digital glitch filter for DIN13</description>
                            <bitOffset>0x1A</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>FILTEREN15_0_DIN13_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN15_0_DIN13_ONE_CYCLE</name>
                                    <description>ONE_CYCLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN15_0_DIN13_THREE_CYCLE</name>
                                    <description>THREE_CYCLE</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN15_0_DIN13_EIGHT_CYCLE</name>
                                    <description>EIGHT_CYCLE</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>FILTEREN15_0_DIN14</name>
                            <description>Programmable counter length of digital glitch filter for DIN14</description>
                            <bitOffset>0x1C</bitOffset>
