fullyautomated/mspm0-svd/svd/mspm0l134x.svd
                            <bitWidth>0x2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>FILTEREN15_0_DIN14_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN15_0_DIN14_ONE_CYCLE</name>
                                    <description>ONE_CYCLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN15_0_DIN14_THREE_CYCLE</name>
                                    <description>THREE_CYCLE</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN15_0_DIN14_EIGHT_CYCLE</name>
                                    <description>EIGHT_CYCLE</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>FILTEREN15_0_DIN15</name>
                            <description>Programmable counter length of digital glitch filter for DIN15</description>
                            <bitOffset>0x1E</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>FILTEREN15_0_DIN15_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN15_0_DIN15_ONE_CYCLE</name>
                                    <description>ONE_CYCLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN15_0_DIN15_THREE_CYCLE</name>
                                    <description>THREE_CYCLE</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN15_0_DIN15_EIGHT_CYCLE</name>
                                    <description>EIGHT_CYCLE</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FILTEREN31_16</name>
                    <description>Filter Enable 31 to 16</description>
                    <addressOffset>0x150C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>FILTEREN31_16_DIN16</name>
                            <description>Programmable counter length of digital glitch filter for DIN16</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>FILTEREN31_16_DIN16_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN31_16_DIN16_ONE_CYCLE</name>
                                    <description>ONE_CYCLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN31_16_DIN16_THREE_CYCLE</name>
                                    <description>THREE_CYCLE</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN31_16_DIN16_EIGHT_CYCLE</name>
                                    <description>EIGHT_CYCLE</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>FILTEREN31_16_DIN17</name>
                            <description>Programmable counter length of digital glitch filter for DIN17</description>
                            <bitOffset>0x2</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>FILTEREN31_16_DIN17_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN31_16_DIN17_ONE_CYCLE</name>
                                    <description>ONE_CYCLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN31_16_DIN17_THREE_CYCLE</name>
                                    <description>THREE_CYCLE</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN31_16_DIN17_EIGHT_CYCLE</name>
                                    <description>EIGHT_CYCLE</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>FILTEREN31_16_DIN18</name>
                            <description>Programmable counter length of digital glitch filter for DIN18</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>FILTEREN31_16_DIN18_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN31_16_DIN18_ONE_CYCLE</name>
                                    <description>ONE_CYCLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN31_16_DIN18_THREE_CYCLE</name>
                                    <description>THREE_CYCLE</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN31_16_DIN18_EIGHT_CYCLE</name>
                                    <description>EIGHT_CYCLE</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>FILTEREN31_16_DIN19</name>
                            <description>Programmable counter length of digital glitch filter for DIN19</description>
                            <bitOffset>0x6</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>FILTEREN31_16_DIN19_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN31_16_DIN19_ONE_CYCLE</name>
                                    <description>ONE_CYCLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN31_16_DIN19_THREE_CYCLE</name>
                                    <description>THREE_CYCLE</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN31_16_DIN19_EIGHT_CYCLE</name>
                                    <description>EIGHT_CYCLE</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>FILTEREN31_16_DIN20</name>
                            <description>Programmable counter length of digital glitch filter for DIN20</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>FILTEREN31_16_DIN20_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN31_16_DIN20_ONE_CYCLE</name>
                                    <description>ONE_CYCLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN31_16_DIN20_THREE_CYCLE</name>
                                    <description>THREE_CYCLE</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN31_16_DIN20_EIGHT_CYCLE</name>
                                    <description>EIGHT_CYCLE</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>FILTEREN31_16_DIN21</name>
                            <description>Programmable counter length of digital glitch filter for DIN21</description>
                            <bitOffset>0xA</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>FILTEREN31_16_DIN21_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN31_16_DIN21_ONE_CYCLE</name>
                                    <description>ONE_CYCLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN31_16_DIN21_THREE_CYCLE</name>
                                    <description>THREE_CYCLE</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN31_16_DIN21_EIGHT_CYCLE</name>
                                    <description>EIGHT_CYCLE</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>FILTEREN31_16_DIN22</name>
                            <description>Programmable counter length of digital glitch filter for DIN22</description>
                            <bitOffset>0xC</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>FILTEREN31_16_DIN22_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN31_16_DIN22_ONE_CYCLE</name>
                                    <description>ONE_CYCLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN31_16_DIN22_THREE_CYCLE</name>
                                    <description>THREE_CYCLE</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN31_16_DIN22_EIGHT_CYCLE</name>
                                    <description>EIGHT_CYCLE</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>FILTEREN31_16_DIN23</name>
                            <description>Programmable counter length of digital glitch filter for DIN23</description>
                            <bitOffset>0xE</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>FILTEREN31_16_DIN23_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN31_16_DIN23_ONE_CYCLE</name>
                                    <description>ONE_CYCLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN31_16_DIN23_THREE_CYCLE</name>
                                    <description>THREE_CYCLE</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN31_16_DIN23_EIGHT_CYCLE</name>
                                    <description>EIGHT_CYCLE</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>FILTEREN31_16_DIN24</name>
                            <description>Programmable counter length of digital glitch filter for DIN24</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>FILTEREN31_16_DIN24_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN31_16_DIN24_ONE_CYCLE</name>
                                    <description>ONE_CYCLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN31_16_DIN24_THREE_CYCLE</name>
                                    <description>THREE_CYCLE</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN31_16_DIN24_EIGHT_CYCLE</name>
                                    <description>EIGHT_CYCLE</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>FILTEREN31_16_DIN25</name>
                            <description>Programmable counter length of digital glitch filter for DIN25</description>
                            <bitOffset>0x12</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>FILTEREN31_16_DIN25_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN31_16_DIN25_ONE_CYCLE</name>
                                    <description>ONE_CYCLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN31_16_DIN25_THREE_CYCLE</name>
                                    <description>THREE_CYCLE</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN31_16_DIN25_EIGHT_CYCLE</name>
                                    <description>EIGHT_CYCLE</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>FILTEREN31_16_DIN26</name>
                            <description>Programmable counter length of digital glitch filter for DIN26</description>
                            <bitOffset>0x14</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>FILTEREN31_16_DIN26_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN31_16_DIN26_ONE_CYCLE</name>
                                    <description>ONE_CYCLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN31_16_DIN26_THREE_CYCLE</name>
                                    <description>THREE_CYCLE</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN31_16_DIN26_EIGHT_CYCLE</name>
                                    <description>EIGHT_CYCLE</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>FILTEREN31_16_DIN27</name>
                            <description>Programmable counter length of digital glitch filter for DIN27</description>
                            <bitOffset>0x16</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>FILTEREN31_16_DIN27_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN31_16_DIN27_ONE_CYCLE</name>
                                    <description>ONE_CYCLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN31_16_DIN27_THREE_CYCLE</name>
                                    <description>THREE_CYCLE</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN31_16_DIN27_EIGHT_CYCLE</name>
                                    <description>EIGHT_CYCLE</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>FILTEREN31_16_DIN28</name>
                            <description>Programmable counter length of digital glitch filter for DIN28</description>
                            <bitOffset>0x18</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <enumeratedValues>
