fullyautomated/mspm0-svd/svd/mspm0l134x.svd
            <register>
                    <name>CLKDIV</name>
                    <description>Clock Divider</description>
                    <addressOffset>0x1000</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CLKDIV_RATIO</name>
                            <description>Selects divide ratio of module clock</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x3</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CLKDIV_RATIO_DIV_BY_1</name>
                                    <description>DIV_BY_1</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CLKDIV_RATIO_DIV_BY_2</name>
                                    <description>DIV_BY_2</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CLKDIV_RATIO_DIV_BY_3</name>
                                    <description>DIV_BY_3</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CLKDIV_RATIO_DIV_BY_4</name>
                                    <description>DIV_BY_4</description>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CLKDIV_RATIO_DIV_BY_5</name>
                                    <description>DIV_BY_5</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CLKDIV_RATIO_DIV_BY_6</name>
                                    <description>DIV_BY_6</description>
                                    <value>5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CLKDIV_RATIO_DIV_BY_7</name>
                                    <description>DIV_BY_7</description>
                                    <value>6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CLKDIV_RATIO_DIV_BY_8</name>
                                    <description>DIV_BY_8</description>
                                    <value>7</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CLKSEL</name>
                    <description>Clock Select for Ultra Low Power peripherals</description>
                    <addressOffset>0x1008</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CLKSEL_MFCLK_SEL</name>
                            <description>Selects MFCLK as clock source if enabled</description>
                            <bitOffset>0x2</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CLKSEL_MFCLK_SEL_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CLKSEL_MFCLK_SEL_ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CLKSEL_BUSCLK_SEL</name>
                            <description>Selects BUS CLK as clock source if enabled</description>
                            <bitOffset>0x3</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CLKSEL_BUSCLK_SEL_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CLKSEL_BUSCLK_SEL_ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CLKSEL_LFCLK_SEL</name>
                            <description>Selects LFCLK as clock source if enabled</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CLKSEL_LFCLK_SEL_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CLKSEL_LFCLK_SEL_ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PDBGCTL</name>
                    <description>Peripheral Debug Control</description>
                    <addressOffset>0x1018</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>PDBGCTL_FREE</name>
                            <description>Free run control</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PDBGCTL_FREE_STOP</name>
                                    <description>STOP</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PDBGCTL_FREE_RUN</name>
                                    <description>RUN</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PDBGCTL_SOFT</name>
                            <description>Soft halt boundary control. This function is only available, if [FREE] is set to 'STOP'</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PDBGCTL_SOFT_IMMEDIATE</name>
                                    <description>IMMEDIATE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PDBGCTL_SOFT_DELAYED</name>
                                    <description>DELAYED</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INT_EVENT0_IIDX</name>
                    <description>Interrupt index</description>
                    <addressOffset>0x1020</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INT_EVENT0_IIDX_STAT</name>
                            <description>UART Module Interrupt Vector Value.  This register provides the highes priority interrupt index. A read clears the corresponding interrupt flag in UARTRIS and UARTMISC. 15h-1Fh = Reserved</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_NO_INTR</name>
                                    <description>NO_INTR</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_RTFG</name>
                                    <description>RTFG</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_FEFG</name>
                                    <description>FEFG</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_PEFG</name>
                                    <description>PEFG</description>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_BEFG</name>
                                    <description>BEFG</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_OEFG</name>
                                    <description>OEFG</description>
                                    <value>5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_RXNE</name>
                                    <description>RXNE</description>
                                    <value>6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_RXPE</name>
                                    <description>RXPE</description>
                                    <value>7</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_LINC0</name>
                                    <description>LINC0</description>
                                    <value>8</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_LINC1</name>
                                    <description>LINC1</description>
                                    <value>9</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_LINOVF</name>
                                    <description>LINOVF</description>
                                    <value>10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_RXIFG</name>
                                    <description>RXIFG</description>
                                    <value>11</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_TXIFG</name>
                                    <description>TXIFG</description>
                                    <value>12</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_EOT</name>
                                    <description>EOT</description>
                                    <value>13</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_MODE_9B</name>
                                    <description>MODE_9B</description>
                                    <value>14</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_CTS</name>
                                    <description>CTS</description>
                                    <value>15</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_DMA_DONE_RX</name>
                                    <description>DMA_DONE_RX</description>
                                    <value>16</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_DMA_DONE_TX</name>
                                    <description>DMA_DONE_TX</description>
                                    <value>17</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_NERR_EVT</name>
                                    <description>NERR_EVT</description>
                                    <value>18</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
