fullyautomated/mspm0-svd/svd/mspm0l134x.svd
                <register>
                    <name>DESC</name>
                    <description>Module Description</description>
                    <addressOffset>0x10FC</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>DESC_MINREV</name>
                            <description>Minor rev of the IP</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x4</bitWidth>
                        </field>
                        <field>
                            <name>DESC_MAJREV</name>
                            <description>Major rev of the IP</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x4</bitWidth>
                        </field>
                        <field>
                            <name>DESC_INSTNUM</name>
                            <description>Instance Number within the device. This will be a parameter to the RTL for modules that can have multiple instances</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x4</bitWidth>
                        </field>
                        <field>
                            <name>DESC_FEATUREVER</name>
                            <description>Feature Set for the module *instance*</description>
                            <bitOffset>0xC</bitOffset>
                            <bitWidth>0x4</bitWidth>
                        </field>
                        <field>
                            <name>DESC_MODULEID</name>
                            <description>Module identification contains a unique peripheral identification number. The assignments are maintained in a central database for all of the platform modules to ensure uniqueness.</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x10</bitWidth>
                        </field>
                    </fields>
                </register>
            <register>
                    <name>TXD</name>
                    <description>Transmit data register</description>
                    <addressOffset>0x1100</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TXD_TX_DATA</name>
                            <description>Contains data written by an external debug tool to the SEC-AP TXDATA register</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x20</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TXCTL</name>
                    <description>Transmit control register</description>
                    <addressOffset>0x1104</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TXCTL_TRANSMIT</name>
                            <description>Indicates data request in DSSM.TXD, set on write via Debug AP to DSSM.TXD.

A read of the DSSM.TXD register by SW will clear the TX field. The tool can check that TXD is empty by reading this field.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>TXCTL_TRANSMIT_EMPTY</name>
                                    <description>EMPTY</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>TXCTL_TRANSMIT_FULL</name>
                                    <description>FULL</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>TXCTL_TRANSMIT_FLAGS</name>
                            <description>Generic TX flags that can be set by external debug tool. Functionality is defined by SW.</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x1F</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RXD</name>
                    <description>Receive data register</description>
                    <addressOffset>0x1108</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RXD_RX_DATA</name>
                            <description>Contains data written by SM/OW.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x20</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RXCTL</name>
                    <description>Receive control register</description>
                    <addressOffset>0x110C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RXCTL_RECEIVE</name>
                            <description>Indicates SW write to the DSSM.RXD register.
A read of the DSSM.RXD register by SWD Access Port will clear the RX field.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>RXCTL_RECEIVE_EMPTY</name>
                                    <description>EMPTY</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RXCTL_RECEIVE_FULL</name>
                                    <description>FULL</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RXCTL_RECEIVE_FLAGS</name>
                            <description>Generic RX flags that can be set by SW and read by external debug tool. Functionality is defined by SW.</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x7</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPECIAL_AUTH</name>
                    <description>Special enable authorization register</description>
                    <addressOffset>0x1200</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000013</resetValue>
                    <fields>
                        <field>
                            <name>SPECIAL_AUTH_SECAPEN</name>
                            <description>An active high input. When asserted (and SWD access is also permitted), the debug tools can use the Security-AP to communicate with security control logic. When deasserted, a DAPBUS firewall will isolate the AP and prevent access to the Security-AP.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>SPECIAL_AUTH_SECAPEN_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SPECIAL_AUTH_SECAPEN_ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SPECIAL_AUTH_SWDPORTEN</name>
                            <description>When asserted, the SW-DP functions normally. 
When deasserted, the SW-DP effectively disables all external debug access.</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>SPECIAL_AUTH_SWDPORTEN_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SPECIAL_AUTH_SWDPORTEN_ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SPECIAL_AUTH_DFTAPEN</name>
                            <description>An active high input. When asserted (and SWD access is also permitted), the debug tools can then access the DFT-AP external to the DebugSS lite. When deasserted, a DAPBUS firewall will isolate the AP and prevent access.</description>
                            <bitOffset>0x2</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>SPECIAL_AUTH_DFTAPEN_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SPECIAL_AUTH_DFTAPEN_ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SPECIAL_AUTH_ETAPEN</name>
                            <description>An active high input. When asserted (and SWD access is also permitted), the debug tools can then access an ET-AP external to the DebugSS lite. When deasserted, a DAPBUS firewall will isolate the AP and prevent access.</description>
                            <bitOffset>0x3</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>SPECIAL_AUTH_ETAPEN_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SPECIAL_AUTH_ETAPEN_ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SPECIAL_AUTH_CFGAPEN</name>
                            <description>An active high input. When asserted (and SWD access is also permitted), the debug tools can use the Config-AP to read device configuration information. When deasserted, a DAPBUS firewall will isolate the AP and prevent access to the Config-AP.</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>SPECIAL_AUTH_CFGAPEN_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SPECIAL_AUTH_CFGAPEN_ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SPECIAL_AUTH_AHBAPEN</name>
                            <description>Disabling / enabling debug access to the M0+ Core via the AHB-AP DAP bus isolation.</description>
                            <bitOffset>0x5</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>SPECIAL_AUTH_AHBAPEN_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SPECIAL_AUTH_AHBAPEN_ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SPECIAL_AUTH_PWRAPEN</name>
                            <description>An active high input. When asserted (and SWD access is also permitted), the debug tools can then access the PWR-AP to power and reset state of the CPU. When deasserted, a DAPBUS firewall will isolate the AP and prevent access.</description>
                            <bitOffset>0x6</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>SPECIAL_AUTH_PWRAPEN_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SPECIAL_AUTH_PWRAPEN_ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>APP_AUTH</name>
                    <description>Application CPU0 authorization register</description>
                    <addressOffset>0x1210</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>APP_AUTH_DBGEN</name>
                            <description>Controls invasive debug enable.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>APP_AUTH_DBGEN_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>APP_AUTH_DBGEN_ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>APP_AUTH_NIDEN</name>
                            <description>Controls non-invasive debug enable.</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>APP_AUTH_NIDEN_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>APP_AUTH_NIDEN_ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>APP_AUTH_SPIDEN</name>
                            <description>Secure invasive debug enable.</description>
                            <bitOffset>0x2</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>APP_AUTH_SPIDEN_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>APP_AUTH_SPIDEN_ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>APP_AUTH_SPNIDEN</name>
                            <description>Secure non-invasive debug enable.</description>
                            <bitOffset>0x3</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>APP_AUTH_SPNIDEN_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>APP_AUTH_SPNIDEN_ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
