fullyautomated/mspm0-svd/svd/mspm0l134x.svd
                <register>
                    <name>STAT</name>
                    <description>Status Register</description>
                    <addressOffset>0x814</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>STAT_RESETSTKY</name>
                            <description>This bit indicates, if the peripheral was reset, since this bit was cleared by RESETSTKYCLR in the RSTCTL register</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>STAT_RESETSTKY_NORES</name>
                                    <description>NORES</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>STAT_RESETSTKY_RESET</name>
                                    <description>RESET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
            <register>
                    <name>CLKDIV</name>
                    <description>Clock Divider</description>
                    <addressOffset>0x1000</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CLKDIV_RATIO</name>
                            <description>Selects divide ratio of module clock</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x3</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CLKDIV_RATIO_DIV_BY_1</name>
                                    <description>DIV_BY_1</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CLKDIV_RATIO_DIV_BY_2</name>
                                    <description>DIV_BY_2</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CLKDIV_RATIO_DIV_BY_3</name>
                                    <description>DIV_BY_3</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CLKDIV_RATIO_DIV_BY_4</name>
                                    <description>DIV_BY_4</description>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CLKDIV_RATIO_DIV_BY_5</name>
                                    <description>DIV_BY_5</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CLKDIV_RATIO_DIV_BY_6</name>
                                    <description>DIV_BY_6</description>
                                    <value>5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CLKDIV_RATIO_DIV_BY_7</name>
                                    <description>DIV_BY_7</description>
                                    <value>6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CLKDIV_RATIO_DIV_BY_8</name>
                                    <description>DIV_BY_8</description>
                                    <value>7</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CLKSEL</name>
                    <description>Clock Select for Ultra Low Power peripherals</description>
                    <addressOffset>0x1008</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CLKSEL_LFCLK_SEL</name>
                            <description>Selects LFCLK as clock source if enabled</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CLKSEL_LFCLK_SEL_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CLKSEL_LFCLK_SEL_ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CLKSEL_MFCLK_SEL</name>
                            <description>Selects MFCLK as clock source if enabled</description>
                            <bitOffset>0x2</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CLKSEL_MFCLK_SEL_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CLKSEL_MFCLK_SEL_ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CLKSEL_BUSCLK_SEL</name>
                            <description>Selects BUSCLK as clock source if enabled</description>
                            <bitOffset>0x3</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CLKSEL_BUSCLK_SEL_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CLKSEL_BUSCLK_SEL_ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PDBGCTL</name>
                    <description>Peripheral Debug Control</description>
                    <addressOffset>0x1018</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>PDBGCTL_FREE</name>
                            <description>Free run control</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PDBGCTL_FREE_STOP</name>
                                    <description>STOP</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PDBGCTL_FREE_RUN</name>
                                    <description>RUN</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PDBGCTL_SOFT</name>
                            <description>Soft halt boundary control. This function is only available, if [FREE] is set to 'STOP'</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PDBGCTL_SOFT_IMMEDIATE</name>
                                    <description>IMMEDIATE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PDBGCTL_SOFT_DELAYED</name>
                                    <description>DELAYED</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IIDX</name>
                    <description>Interrupt index</description>
                    <addressOffset>0x1020</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IIDX_STAT</name>
                            <description>Interrupt index status</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>IIDX_STAT_NO_INTR</name>
                                    <description>NO_INTR</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IIDX_STAT_Z</name>
                                    <description>Z</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IIDX_STAT_L</name>
                                    <description>L</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IIDX_STAT_CCD0</name>
                                    <description>CCD0</description>
                                    <value>5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IIDX_STAT_CCD1</name>
                                    <description>CCD1</description>
                                    <value>6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IIDX_STAT_CCD2</name>
                                    <description>CCD2</description>
                                    <value>7</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IIDX_STAT_CCD3</name>
                                    <description>CCD3</description>
                                    <value>8</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IIDX_STAT_CCU0</name>
                                    <description>CCU0</description>
                                    <value>9</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IIDX_STAT_CCU1</name>
                                    <description>CCU1</description>
                                    <value>10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IIDX_STAT_CCU2</name>
                                    <description>CCU2</description>
                                    <value>11</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IIDX_STAT_CCU3</name>
                                    <description>CCU3</description>
                                    <value>12</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IIDX_STAT_CCD4</name>
                                    <description>CCD4</description>
                                    <value>13</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IIDX_STAT_CCD5</name>
                                    <description>CCD5</description>
                                    <value>14</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IIDX_STAT_CCU4</name>
                                    <description>CCU4</description>
                                    <value>15</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IIDX_STAT_CCU5</name>
                                    <description>CCU5</description>
                                    <value>16</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IIDX_STAT_F</name>
                                    <description>F</description>
                                    <value>25</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IIDX_STAT_TOV</name>
                                    <description>TOV</description>
                                    <value>26</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IIDX_STAT_REPC</name>
                                    <description>REPC</description>
                                    <value>27</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IIDX_STAT_DC</name>
                                    <description>DC</description>
                                    <value>28</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IIDX_STAT_QEIERR</name>
                                    <description>QEIERR</description>
                                    <value>29</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
