fullyautomated/mspm0-svd/svd/mspm0l134x.svd
                <register>
                    <name>RESETLEVEL</name>
                    <description>Reset level for application-triggered reset command</description>
                    <addressOffset>0x1300</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000007</resetMask>
                    <fields>
                        <field>
                            <name>RESETLEVEL_LEVEL</name>
                            <description>LEVEL is used to specify the type of reset to be issued when RESETCMD is set to generate a software triggered reset.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x3</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>RESETLEVEL_LEVEL_CPU</name>
                                    <description>CPU</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RESETLEVEL_LEVEL_BOOT</name>
                                    <description>BOOT</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RESETLEVEL_LEVEL_BOOTLOADERENTRY</name>
                                    <description>BOOTLOADERENTRY</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RESETLEVEL_LEVEL_POR</name>
                                    <description>POR</description>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RESETLEVEL_LEVEL_BOOTLOADEREXIT</name>
                                    <description>BOOTLOADEREXIT</description>
                                    <value>4</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RESETCMD</name>
                    <description>Execute an application-triggered reset command</description>
                    <addressOffset>0x1304</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xff000001</resetMask>
                    <fields>
                        <field>
                            <name>RESETCMD_KEY</name>
                            <description>The key value of E4h (228) must be written to KEY together with GO to trigger the reset.</description>
                            <bitOffset>0x18</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>RESETCMD_KEY_VALUE</name>
                                    <description>VALUE</description>
                                    <value>228</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RESETCMD_GO</name>
                            <description>Execute the reset specified in RESETLEVEL.LEVEL.  Must be written together with the KEY.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>RESETCMD_GO_TRUE</name>
                                    <description>TRUE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BORTHRESHOLD</name>
                    <description>BOR threshold selection</description>
                    <addressOffset>0x1308</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000003</resetMask>
                    <fields>
                        <field>
                            <name>BORTHRESHOLD_LEVEL</name>
                            <description>LEVEL specifies the desired BOR threshold and BOR mode.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>BORTHRESHOLD_LEVEL_BORMIN</name>
                                    <description>BORMIN</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>BORTHRESHOLD_LEVEL_BORLEVEL1</name>
                                    <description>BORLEVEL1</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>BORTHRESHOLD_LEVEL_BORLEVEL2</name>
                                    <description>BORLEVEL2</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>BORTHRESHOLD_LEVEL_BORLEVEL3</name>
                                    <description>BORLEVEL3</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BORCLRCMD</name>
                    <description>Set the BOR threshold</description>
                    <addressOffset>0x130C</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xff000001</resetMask>
                    <fields>
                        <field>
                            <name>BORCLRCMD_KEY</name>
                            <description>The key value of C7h (199) must be written to KEY together with GO to trigger the clear and BOR threshold change.</description>
                            <bitOffset>0x18</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>BORCLRCMD_KEY_VALUE</name>
                                    <description>VALUE</description>
                                    <value>199</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>BORCLRCMD_GO</name>
                            <description>GO clears any prior BOR violation status indications and attempts to change the active BOR mode to that specified in the LEVEL field of the BORTHRESHOLD register.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>BORCLRCMD_GO_TRUE</name>
                                    <description>TRUE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SYSOSCFCLCTL</name>
                    <description>SYSOSC frequency correction loop (FCL) ROSC enable</description>
                    <addressOffset>0x1310</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xff000001</resetMask>
                    <fields>
                        <field>
                            <name>SYSOSCFCLCTL_KEY</name>
                            <description>The key value of 2Ah (42) must be written to KEY together with SETUSEFCL to enable the FCL.</description>
                            <bitOffset>0x18</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>SYSOSCFCLCTL_KEY_VALUE</name>
                                    <description>VALUE</description>
                                    <value>42</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SYSOSCFCLCTL_SETUSEFCL</name>
                            <description>Set SETUSEFCL to enable the frequency correction loop in SYSOSC.  Once enabled, this state is locked until the next BOOTRST.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>SYSOSCFCLCTL_SETUSEFCL_TRUE</name>
                                    <description>TRUE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SHDNIOREL</name>
                    <description>SHUTDOWN IO release control</description>
                    <addressOffset>0x131C</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xff000001</resetMask>
                    <fields>
                        <field>
                            <name>SHDNIOREL_KEY</name>
                            <description>The key value 91h must be written to KEY together with RELEASE to set RELEASE.</description>
                            <bitOffset>0x18</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>SHDNIOREL_KEY_VALUE</name>
                                    <description>VALUE</description>
                                    <value>145</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SHDNIOREL_RELEASE</name>
                            <description>Set RELEASE to release the IO after a SHUTDOWN mode exit.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>SHDNIOREL_RELEASE_TRUE</name>
                                    <description>TRUE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EXRSTPIN</name>
                    <description>Disable the reset function of the NRST pin</description>
                    <addressOffset>0x1320</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xff000001</resetMask>
                    <fields>
                        <field>
                            <name>EXRSTPIN_KEY</name>
                            <description>The key value 1Eh must be written together with DISABLE to disable the reset function.</description>
                            <bitOffset>0x18</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>EXRSTPIN_KEY_VALUE</name>
                                    <description>VALUE</description>
                                    <value>30</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>EXRSTPIN_DISABLE</name>
                            <description>Set DISABLE to disable the reset function of the NRST pin.  Once set, this configuration is locked until the next POR.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>EXRSTPIN_DISABLE_FALSE</name>
                                    <description>FALSE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>EXRSTPIN_DISABLE_TRUE</name>
                                    <description>TRUE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SWDCFG</name>
                    <description>Disable the SWD function on the SWD pins</description>
                    <addressOffset>0x1328</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xff000001</resetMask>
                    <fields>
                        <field>
                            <name>SWDCFG_KEY</name>
                            <description>The key value 62h (98) must be written to KEY together with DISBALE to disable the SWD functions.</description>
                            <bitOffset>0x18</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>SWDCFG_KEY_VALUE</name>
                                    <description>VALUE</description>
                                    <value>98</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SWDCFG_DISABLE</name>
                            <description>Set DISABLE to disable the SWD function on SWD pins, allowing the SWD pins to be used as GPIO.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>SWDCFG_DISABLE_TRUE</name>
                                    <description>TRUE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FCCCMD</name>
                    <description>Frequency clock counter start capture</description>
                    <addressOffset>0x132C</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xff000001</resetMask>
                    <fields>
                        <field>
                            <name>FCCCMD_KEY</name>
                            <description>The key value 0Eh (14) must be written with GO to start a capture.</description>
                            <bitOffset>0x18</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>FCCCMD_KEY_VALUE</name>
                                    <description>VALUE</description>
                                    <value>14</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>FCCCMD_GO</name>
                            <description>Set GO to start a capture with the frequency clock counter (FCC).</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>FCCCMD_GO_TRUE</name>
                                    <description>TRUE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
