fullyautomated/mspm0-svd/svd/mspm0l134x.svd
                <register>
                    <name>INT_EVENT2_RIS</name>
                    <description>Raw interrupt status</description>
                    <addressOffset>0x1090</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INT_EVENT2_RIS_MRXFIFOTRG</name>
                            <description>Master Receive FIFO Trigger
Trigger when RX FIFO contains &amp;gt;= defined bytes</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT2_RIS_MRXFIFOTRG_CLR</name>
                                    <description>CLR</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT2_RIS_MRXFIFOTRG_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INT_EVENT2_RIS_MTXFIFOTRG</name>
                            <description>Master Transmit FIFO Trigger
Trigger when Transmit FIFO contains &amp;lt;= defined bytes</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT2_RIS_MTXFIFOTRG_CLR</name>
                                    <description>CLR</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT2_RIS_MTXFIFOTRG_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INT_EVENT2_RIS_SRXFIFOTRG</name>
                            <description>Slave Receive FIFO Trigger</description>
                            <bitOffset>0x2</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT2_RIS_SRXFIFOTRG_CLR</name>
                                    <description>CLR</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT2_RIS_SRXFIFOTRG_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INT_EVENT2_RIS_STXFIFOTRG</name>
                            <description>Slave Transmit FIFO Trigger</description>
                            <bitOffset>0x3</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT2_RIS_STXFIFOTRG_CLR</name>
                                    <description>CLR</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT2_RIS_STXFIFOTRG_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INT_EVENT2_MIS</name>
                    <description>Masked interrupt status</description>
                    <addressOffset>0x1098</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INT_EVENT2_MIS_MRXFIFOTRG</name>
                            <description>Master Receive FIFO Trigger
Trigger when RX FIFO contains &amp;gt;= defined bytes</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT2_MIS_MRXFIFOTRG_CLR</name>
                                    <description>CLR</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT2_MIS_MRXFIFOTRG_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INT_EVENT2_MIS_MTXFIFOTRG</name>
                            <description>Master Transmit FIFO Trigger
Trigger when Transmit FIFO contains &amp;lt;= defined bytes</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT2_MIS_MTXFIFOTRG_CLR</name>
                                    <description>CLR</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT2_MIS_MTXFIFOTRG_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INT_EVENT2_MIS_SRXFIFOTRG</name>
                            <description>Slave Receive FIFO Trigger</description>
                            <bitOffset>0x2</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT2_MIS_SRXFIFOTRG_CLR</name>
                                    <description>CLR</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT2_MIS_SRXFIFOTRG_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INT_EVENT2_MIS_STXFIFOTRG</name>
                            <description>Slave Transmit FIFO Trigger</description>
                            <bitOffset>0x3</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT2_MIS_STXFIFOTRG_CLR</name>
                                    <description>CLR</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT2_MIS_STXFIFOTRG_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INT_EVENT2_ISET</name>
                    <description>Interrupt set</description>
                    <addressOffset>0x10A0</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INT_EVENT2_ISET_MRXFIFOTRG</name>
                            <description>Master Receive FIFO Trigger
Trigger when RX FIFO contains &amp;gt;= defined bytes</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT2_ISET_MRXFIFOTRG_NO_EFFECT</name>
                                    <description>NO_EFFECT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT2_ISET_MRXFIFOTRG_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INT_EVENT2_ISET_MTXFIFOTRG</name>
                            <description>Master Transmit FIFO Trigger
Trigger when Transmit FIFO contains &amp;lt;= defined bytes</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT2_ISET_MTXFIFOTRG_NO_EFFECT</name>
                                    <description>NO_EFFECT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT2_ISET_MTXFIFOTRG_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INT_EVENT2_ISET_SRXFIFOTRG</name>
                            <description>Slave Receive FIFO Trigger</description>
                            <bitOffset>0x2</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT2_ISET_SRXFIFOTRG_NO_EFFECT</name>
                                    <description>NO_EFFECT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT2_ISET_SRXFIFOTRG_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INT_EVENT2_ISET_STXFIFOTRG</name>
                            <description>Slave Transmit FIFO Trigger</description>
                            <bitOffset>0x3</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT2_ISET_STXFIFOTRG_NO_EFFECT</name>
                                    <description>NO_EFFECT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT2_ISET_STXFIFOTRG_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INT_EVENT2_ICLR</name>
                    <description>Interrupt clear</description>
                    <addressOffset>0x10A8</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INT_EVENT2_ICLR_MRXFIFOTRG</name>
                            <description>Master Receive FIFO Trigger
Trigger when RX FIFO contains &amp;gt;= defined bytes</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT2_ICLR_MRXFIFOTRG_NO_EFFECT</name>
                                    <description>NO_EFFECT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT2_ICLR_MRXFIFOTRG_CLR</name>
                                    <description>CLR</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INT_EVENT2_ICLR_MTXFIFOTRG</name>
                            <description>Master Transmit FIFO Trigger
Trigger when Transmit FIFO contains &amp;lt;= defined bytes</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT2_ICLR_MTXFIFOTRG_NO_EFFECT</name>
                                    <description>NO_EFFECT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT2_ICLR_MTXFIFOTRG_CLR</name>
                                    <description>CLR</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INT_EVENT2_ICLR_SRXFIFOTRG</name>
                            <description>Slave Receive FIFO Trigger</description>
                            <bitOffset>0x2</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT2_ICLR_SRXFIFOTRG_NO_EFFECT</name>
                                    <description>NO_EFFECT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT2_ICLR_SRXFIFOTRG_CLR</name>
                                    <description>CLR</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INT_EVENT2_ICLR_STXFIFOTRG</name>
                            <description>Slave Transmit FIFO Trigger</description>
                            <bitOffset>0x3</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT2_ICLR_STXFIFOTRG_NO_EFFECT</name>
                                    <description>NO_EFFECT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT2_ICLR_STXFIFOTRG_CLR</name>
                                    <description>CLR</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EVT_MODE</name>
                    <description>Event Mode</description>
                    <addressOffset>0x10E0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>EVT_MODE_INT0_CFG</name>
                            <description>Event line mode select for event corresponding to [IPSTANDARD.INT_EVENT0]</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>EVT_MODE_INT0_CFG_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>EVT_MODE_INT0_CFG_SOFTWARE</name>
                                    <description>SOFTWARE</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>EVT_MODE_INT0_CFG_HARDWARE</name>
                                    <description>HARDWARE</description>
                                    <value>2</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>EVT_MODE_INT1_CFG</name>
                            <description>Event line mode select for event corresponding to [IPSTANDARD.INT_EVENT1]</description>
                            <bitOffset>0x2</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>EVT_MODE_INT1_CFG_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>EVT_MODE_INT1_CFG_SOFTWARE</name>
                                    <description>SOFTWARE</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>EVT_MODE_INT1_CFG_HARDWARE</name>
                                    <description>HARDWARE</description>
                                    <value>2</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>EVT_MODE_EVT2_CFG</name>
                            <description>Event line mode select for event corresponding to [IPSTANDARD.INT_EVENT2]</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>EVT_MODE_EVT2_CFG_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>EVT_MODE_EVT2_CFG_SOFTWARE</name>
                                    <description>SOFTWARE</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>EVT_MODE_EVT2_CFG_HARDWARE</name>
                                    <description>HARDWARE</description>
                                    <value>2</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
