fullyautomated/mspm0-svd/svd/mspm0l134x.svd
In the normal Slave use case, FW would set PECEN=1 and PECCNT=0 and use the ACKOEN until the remaining SMB packet length is known. FW would then set the PECCNT to the remaining packet length (Including PEC bye). FW would then configure DMA to allow the packet to complete unassisted and exit NoAck mode.

Note that when the byte count = PEC CNT, the byte count is reset to 0 and multiple PEC calculation can automatically occur within a single I2C transaction</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x9</bitWidth>
                        </field>
                        <field>
                            <name>SLAVE_PECCTL_PECEN</name>
                            <description>PEC Enable
This bit enables the SMB Packet Error Checking (PEC). When enabled the PEC is calculated on all bits accept the Start, Stop, Ack and Nack. The PEC LSFR and the Byte Counter is set to 0 when the State Machine is in the IDLE state, which occur following a Stop or when a timeout occurs. The Counter is also set to 0 after the PEC byte is sent or received. Note that the NACK is automatically send following a PEC byte that results in a PEC error.
The PEC Polynomial is x^8 + x^2 + x^1 + 1.</description>
                            <bitOffset>0xC</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>SLAVE_PECCTL_PECEN_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SLAVE_PECCTL_PECEN_ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SLAVE_PECSR</name>
                    <description>I2C slave PEC status register</description>
                    <addressOffset>0x1278</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>SLAVE_PECSR_PECBYTECNT</name>
                            <description>This is the current PEC Byte Count of the Slave State Machine.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x9</bitWidth>
                        </field>
                        <field>
                            <name>SLAVE_PECSR_PECSTS_CHECK</name>
                            <description>This status bit indicates if the PEC was checked in the transaction that occurred before the last Stop. Latched on Stop.</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>SLAVE_PECSR_PECSTS_CHECK_CLEARED</name>
                                    <description>CLEARED</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SLAVE_PECSR_PECSTS_CHECK_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SLAVE_PECSR_PECSTS_ERROR</name>
                            <description>This status bit indicates if a PEC check error occurred in the transaction that occurred before the last Stop. Latched on Stop.</description>
                            <bitOffset>0x11</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>SLAVE_PECSR_PECSTS_ERROR_CLEARED</name>
                                    <description>CLEARED</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SLAVE_PECSR_PECSTS_ERROR_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
            </registers></peripheral>
        <peripheral>
            <name>IOMUX</name>
            <version>1.0</version>
            <description>PERIPHERALREGION</description>
            <baseAddress>0x40428000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x2000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers><register>
                    <dim>61</dim>
                    <dimIncrement>4</dimIncrement>
                    <dimArrayIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60</dimArrayIndex>
                    <name>PINCM[%s]</name>
                    <description>Pin Control Management Register in SECCFG region</description>
                    <addressOffset>0x4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x7f7fffff</resetMask>
                    <fields>
                        <field>
                            <name>PINCM_PF</name>
                            <description>P channel Function selection bits</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x6</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PINCM_PC</name>
                            <description>Peripheral is Connected</description>
                            <bitOffset>0x7</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PINCM_PC_UNCONNECTED</name>
                                    <description>UNCONNECTED</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PINCM_PC_CONNECTED</name>
                                    <description>CONNECTED</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PINCM_WAKESTAT</name>
                            <description>This has the IOPAD WAKEUP signal as status bit.</description>
                            <bitOffset>0xD</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PINCM_WAKESTAT_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PINCM_WAKESTAT_ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PINCM_PIPD</name>
                            <description>Pull Down control selection</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PINCM_PIPD_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PINCM_PIPD_ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PINCM_PIPU</name>
                            <description>Pull Up control selection</description>
                            <bitOffset>0x11</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PINCM_PIPU_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PINCM_PIPU_ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PINCM_INENA</name>
                            <description>Input Enable Control Selection</description>
                            <bitOffset>0x12</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PINCM_INENA_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PINCM_INENA_ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PINCM_HYSTEN</name>
                            <description>Hystersis Enable Control Selection</description>
                            <bitOffset>0x13</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PINCM_HYSTEN_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PINCM_HYSTEN_ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PINCM_DRV</name>
                            <description>Drive strength control selection, for HS IOCELL only</description>
                            <bitOffset>0x14</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PINCM_DRV_DRVVAL0</name>
                                    <description>DRVVAL0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PINCM_DRV_DRVVAL1</name>
                                    <description>DRVVAL1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PINCM_HIZ1</name>
                            <description>High output value will tri-state the output when this bit is enabled</description>
                            <bitOffset>0x19</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PINCM_HIZ1_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PINCM_HIZ1_ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PINCM_WUEN</name>
                            <description>Wakeup Enable bit</description>
                            <bitOffset>0x1B</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PINCM_WUEN_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PINCM_WUEN_ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PINCM_WCOMP</name>
                            <description>Wakeup Compare Value bit</description>
                            <bitOffset>0x1C</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PINCM_WCOMP_MATCH0</name>
                                    <description>MATCH0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PINCM_WCOMP_MATCH1</name>
                                    <description>MATCH1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PINCM_INV</name>
                            <description>Data inversion selection</description>
                            <bitOffset>0x1A</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PINCM_INV_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PINCM_INV_ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
            </registers></peripheral>
        <peripheral>
            <name>TIMG2</name>
            <version>1.0</version>
            <description>PERIPHERALREGION</description>
            <baseAddress>0x40088000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x1F00</size>
                <usage>registers</usage>
            </addressBlock>
            <registers><register>
                    <name>FSUB_0</name>
                    <description>Subsciber Port 0</description>
                    <addressOffset>0x400</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>FSUB_0_CHANID</name>
                            <description>0 = disconnected.
1-15 = connected to channelID = CHANID.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>FSUB_0_CHANID_UNCONNECTED</name>
                                    <description>UNCONNECTED</description>
                                    <value>0</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FSUB_1</name>
                    <description>Subscriber Port 1</description>
                    <addressOffset>0x404</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>FSUB_1_CHANID</name>
                            <description>0 = disconnected.
1-15 = connected to channelID = CHANID.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>FSUB_1_CHANID_UNCONNECTED</name>
                                    <description>UNCONNECTED</description>
                                    <value>0</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FPUB_0</name>
                    <description>Publisher Port 0</description>
                    <addressOffset>0x444</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>FPUB_0_CHANID</name>
                            <description>0 = disconnected.
1-15 = connected to channelID = CHANID.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>FPUB_0_CHANID_UNCONNECTED</name>
                                    <description>UNCONNECTED</description>
                                    <value>0</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FPUB_1</name>
                    <description>Publisher Port 1</description>
                    <addressOffset>0x448</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>FPUB_1_CHANID</name>
                            <description>0 = disconnected.
1-15 = connected to channelID = CHANID.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>FPUB_1_CHANID_UNCONNECTED</name>
                                    <description>UNCONNECTED</description>
                                    <value>0</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
