fullyautomated/mspm0-svd/svd/mspm0l134x.svd
                <register>
                    <dim>2</dim>
                    <dimIncrement>4</dimIncrement>
                    <dimArrayIndex>0,1</dimArrayIndex>
                    <name>OCTL_01[%s]</name>
                    <description>CCP Output Control Registers</description>
                    <addressOffset>0x1850</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>OCTL_01_CCPOINV</name>
                            <description>CCP Output Invert The output as selected by CCPO is conditionally inverted.</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>OCTL_01_CCPOINV_NOINV</name>
                                    <description>NOINV</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>OCTL_01_CCPOINV_INV</name>
                                    <description>INV</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>OCTL_01_CCPIV</name>
                            <description>CCP Initial Value This bit specifies the logical value put on the signal generator state while the counter is disabled (CTRCTL.EN == 0).</description>
                            <bitOffset>0x5</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>OCTL_01_CCPIV_LOW</name>
                                    <description>LOW</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>OCTL_01_CCPIV_HIGH</name>
                                    <description>HIGH</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>OCTL_01_CCPO</name>
                            <description>CCP Output Source</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>OCTL_01_CCPO_FUNCVAL</name>
                                    <description>FUNCVAL</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>OCTL_01_CCPO_LOAD</name>
                                    <description>LOAD</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>OCTL_01_CCPO_CMPVAL</name>
                                    <description>CMPVAL</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>OCTL_01_CCPO_ZERO</name>
                                    <description>ZERO</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>OCTL_01_CCPO_CAPCOND</name>
                                    <description>CAPCOND</description>
                                    <value>5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>OCTL_01_CCPO_FAULTCOND</name>
                                    <description>FAULTCOND</description>
                                    <value>6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>OCTL_01_CCPO_CC0_MIRROR_ALL</name>
                                    <description>CC0_MIRROR_ALL</description>
                                    <value>8</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>OCTL_01_CCPO_CC1_MIRROR_ALL</name>
                                    <description>CC1_MIRROR_ALL</description>
                                    <value>9</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>OCTL_01_CCPO_DEADBAND</name>
                                    <description>DEADBAND</description>
                                    <value>12</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>OCTL_01_CCPO_CNTDIR</name>
                                    <description>CNTDIR</description>
                                    <value>13</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>4</dimIncrement>
                    <dimArrayIndex>0,1</dimArrayIndex>
                    <name>CCACT_01[%s]</name>
                    <description>Capture or Compare Action Registers</description>
                    <addressOffset>0x1870</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>CCACT_01_ZACT</name>
                            <description>CCP Output Action on Zero  Specifies what changes occur to CCP output as the result of a zero event.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CCACT_01_ZACT_DISABLED</name>
                                    <description>DISABLED</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCACT_01_ZACT_CCP_HIGH</name>
                                    <description>CCP_HIGH</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCACT_01_ZACT_CCP_LOW</name>
                                    <description>CCP_LOW</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCACT_01_ZACT_CCP_TOGGLE</name>
                                    <description>CCP_TOGGLE</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CCACT_01_LACT</name>
                            <description>CCP Output Action on Load  Specifies what changes occur to CCP output as the result of a load event.</description>
                            <bitOffset>0x3</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CCACT_01_LACT_DISABLED</name>
                                    <description>DISABLED</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCACT_01_LACT_CCP_HIGH</name>
                                    <description>CCP_HIGH</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCACT_01_LACT_CCP_LOW</name>
                                    <description>CCP_LOW</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCACT_01_LACT_CCP_TOGGLE</name>
                                    <description>CCP_TOGGLE</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CCACT_01_CDACT</name>
                            <description>CCP Output Action on Compare (Down)  This field describes the resulting action of the signal generator upon detecting a compare event while counting down.</description>
                            <bitOffset>0x6</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CCACT_01_CDACT_DISABLED</name>
                                    <description>DISABLED</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCACT_01_CDACT_CCP_HIGH</name>
                                    <description>CCP_HIGH</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCACT_01_CDACT_CCP_LOW</name>
                                    <description>CCP_LOW</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCACT_01_CDACT_CCP_TOGGLE</name>
                                    <description>CCP_TOGGLE</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CCACT_01_CUACT</name>
                            <description>CCP Output Action on Compare (Up)  This field describes the resulting action of the signal generator upon detecting a compare event while counting up.</description>
                            <bitOffset>0x9</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CCACT_01_CUACT_DISABLED</name>
                                    <description>DISABLED</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCACT_01_CUACT_CCP_HIGH</name>
                                    <description>CCP_HIGH</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCACT_01_CUACT_CCP_LOW</name>
                                    <description>CCP_LOW</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCACT_01_CUACT_CCP_TOGGLE</name>
                                    <description>CCP_TOGGLE</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CCACT_01_CC2DACT</name>
                            <description>CCP Output Action on CC2D event.</description>
                            <bitOffset>0xC</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CCACT_01_CC2DACT_DISABLED</name>
                                    <description>DISABLED</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCACT_01_CC2DACT_CCP_HIGH</name>
                                    <description>CCP_HIGH</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCACT_01_CC2DACT_CCP_LOW</name>
                                    <description>CCP_LOW</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCACT_01_CC2DACT_CCP_TOGGLE</name>
                                    <description>CCP_TOGGLE</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CCACT_01_CC2UACT</name>
                            <description>CCP Output Action on CC2U event.</description>
                            <bitOffset>0xF</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CCACT_01_CC2UACT_DISABLED</name>
                                    <description>DISABLED</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCACT_01_CC2UACT_CCP_HIGH</name>
                                    <description>CCP_HIGH</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCACT_01_CC2UACT_CCP_LOW</name>
                                    <description>CCP_LOW</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCACT_01_CC2UACT_CCP_TOGGLE</name>
                                    <description>CCP_TOGGLE</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CCACT_01_SWFRCACT</name>
                            <description>CCP Output Action on Software Froce Output

This field describes the resulting action of software force.

This action has a shadow register, which will be updated under specific condition. 
So that this register cannot take into effect immediately.</description>
                            <bitOffset>0x1C</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CCACT_01_SWFRCACT_DISABLED</name>
                                    <description>DISABLED</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCACT_01_SWFRCACT_CCP_HIGH</name>
                                    <description>CCP_HIGH</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCACT_01_SWFRCACT_CCP_LOW</name>
                                    <description>CCP_LOW</description>
                                    <value>2</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
